In [0]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Age'] = df['Age'].astype(float).astype(int)

In [43]:
# Drop unwanted variables
df.drop(['PassengerId','Name','Pclass','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns' ,inplace=True)
df.head()

      Sex  Age     Fare  Survived
0    male   22   7.2500         0
1  female   38  71.2833         1
2  female   26   7.9250         1
3  female   35  53.1000         1
4    male   35   8.0500         0

In [44]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [0]:
df.drop(['Sex'], axis='columns', inplace=True)
df.head()
independent_var_y = df.Survived
dependent_var_x= df.drop(['Survived'], axis='columns')

In [46]:
dependent_var_x = pd.concat([dependent_var_x,dummies], axis='columns')
dependent_var_x.head()
# dependent_var_x.columns[dependent_var_x.isna().any()]
# dependent_var_x.isna().any()

   Age     Fare  female  male
0   22   7.2500       0     1
1   38  71.2833       1     0
2   26   7.9250       1     0
3   35  53.1000       1     0
4   35   8.0500       0     1

In [47]:
import numpy as np
dependent_var_x.Age = dependent_var_x.Age.fillna(dependent_var_x.Age.mean())
dependent_var_x.head()

   Age     Fare  female  male
0   22   7.2500       0     1
1   38  71.2833       1     0
2   26   7.9250       1     0
3   35  53.1000       1     0
4   35   8.0500       0     1

In [48]:
from sklearn.model_selection import train_test_split
X_train,x_test,Y_train,y_test = train_test_split(dependent_var_x, independent_var_y, test_size=0.1, random_state=32)
X_train

     Age      Fare  female  male
763   36  120.0000       1     0
51    21    7.8000       0     1
17    29   13.0000       0     1
565   24   24.1500       0     1
689   15  211.3375       1     0
..   ...       ...     ...   ...
403   28   15.8500       0     1
88    23  263.0000       1     0
310   24   83.1583       1     0
555   62   26.5500       0     1
727   29    7.7375       1     0

[801 rows x 4 columns]

In [49]:
from sklearn.naive_bayes import GaussianNB #Good NaiveBayes model
naivebayes = GaussianNB()
naivebayes.fit(X_train,Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [50]:
naivebayes.score(x_test,y_test)

0.8222222222222222

In [52]:
x_test.head(10)

     Age      Fare  female  male
837   29    8.0500       0     1
334   29  133.6500       1     0
849   29   89.1042       1     0
778   29    7.7375       0     1
413   29    0.0000       0     1
151   22   66.6000       1     0
826   29   56.4958       0     1
282   16    9.5000       0     1
881   33    7.8958       0     1
848   28   33.0000       0     1

In [58]:
naivebayes.predict(x_test.head(10))

array([0, 1, 1, 0, 0, 1, 0, 0, 0, 0])

In [56]:
naivebayes.predict_proba(x_test.head(10))

''' 
  Analyzing the Below Results

  As per first Result in Array - [9.77261964e-01, 2.27380362e-02]
  
  The Probability of Death is : 9.77261964e-01
  The Probability of Alive is : 2.27380362e-02
'''

array([[9.77261964e-01, 2.27380362e-02],
       [1.28501426e-04, 9.99871499e-01],
       [3.75898798e-03, 9.96241012e-01],
       [9.77230450e-01, 2.27695495e-02],
       [9.75873230e-01, 2.41267702e-02],
       [1.03802316e-02, 9.89619768e-01],
       [9.55330726e-01, 4.46692740e-02],
       [9.71904244e-01, 2.80957563e-02],
       [9.77996220e-01, 2.20037801e-02],
       [9.73863057e-01, 2.61369427e-02]])